#include <stdio.h>
#include <math.h>
//25.다음과 같은 출력이 나오도록 프로그램을 작성하시오.
//*********** 54321012345	-5- 별11 공백1 54321 0 12345
//********* 432101234		-4- 별9  공백1 4321 0 1234
//******* 3210123			-3- 별7  공백1 321 0 123
//***** 21012				-2- 별5  공백1 21 0 12
//*** 101					-1- 별3  공백1 1 0 1 
//* 0						 0- 별1  공백1 0   
//*** 101					+1- 별3  공백1 1 0 1
//***** 21012				+2- 별5  공백1 21 0 12
//******* 3210123			+3- 별7  공백1 321 0 123
//********* 432101234		+4- 별9  공백1 4321 0 1234 
//*********** 54321012345	+5- 별10 공백1 54321 0 12345

void main(void){
	int i,j,k,a,b;

	for(i=-5; i<=5; i++){
		for(j=0; j<(abs(i))*2+1;j++){
			printf("*");
		}
		printf(" ");
		for(k=0; k<(abs(i))*2+1; k++){
			printf("");
		}
		for(a=(abs(i)); a>=1; a--){
			printf("%d",a);
		}
		printf("0");
		for(b=1; b<=(abs(i)); b++){
			printf("%d",b);
		}
		printf("\n");
	}


}